# Ultralytics YOLOv3 🚀, AGPL-3.0 license

# 参数
nc: 80  # 类别数量
depth_multiple: 1.0  # 模型深度倍数
width_multiple: 1.0  # 层通道倍数
anchors:  # 锚框
  - [10, 14, 23, 27, 37, 58]  # P4/16层的锚框
  - [81, 82, 135, 169, 344, 319]  # P5/32层的锚框

# YOLOv3-tiny骨干网络
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [16, 3, 1]],  # 0，卷积层：输入通道数16，卷积核3x3，步长1
    [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 1，最大池化层：2x2，步长2，P1/2层
    [-1, 1, Conv, [32, 3, 1]],  # 卷积层：输入通道数32，卷积核3x3，步长1
    [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 3，最大池化层：2x2，步长2，P2/4层
    [-1, 1, Conv, [64, 3, 1]],  # 卷积层：输入通道数64，卷积核3x3，步长1
    [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 5，最大池化层：2x2，步长2，P3/8层
    [-1, 1, Conv, [128, 3, 1]],  # 卷积层：输入通道数128，卷积核3x3，步长1
    [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 7，最大池化层：2x2，步长2，P4/16层
    [-1, 1, Conv, [256, 3, 1]],  # 卷积层：输入通道数256，卷积核3x3，步长1
    [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 9，最大池化层：2x2，步长2，P5/32层
    [-1, 1, Conv, [512, 3, 1]],  # 卷积层：输入通道数512，卷积核3x3，步长1
    [-1, 1, nn.ZeroPad2d, [[0, 1, 0, 1]]],  # 11，零填充层
    [-1, 1, nn.MaxPool2d, [2, 1, 0]],  # 12，最大池化层：2x1，步长2
  ]

# YOLOv3-tiny头部
head: [
    [-1, 1, Conv, [1024, 3, 1]],  # 卷积层：输入通道数1024，卷积核3x3
    [-1, 1, Conv, [256,
